matteogastaldello/msp432-endpoint/main.c
#include "simplelink.h"
#include "sl_common.h"

//code libraries
#include <stdio.h>
#include <net/bsd/netdb.h>
#include <net/bsd/netinet/in.h>
#include <stdlib.h>
#include <string.h>
#include <socket.h>
#include <sys/types.h>
#include <unistd.h> // read(), write(), close()

#include <driverlib.h>
//LcdDriver
#include <msp.h>
#include <ti/grlib/grlib.h>
#include "LcdDriver/Crystalfontz128x128_ST7735.h"
#include "LcdDriver/HAL_MSP_EXP432P401R_Crystalfontz128x128_ST7735.h"
#include "HAL/HAL_I2C.h"
#include "HAL/HAL_TMP006.h"
#include "HAL/HAL_OPT3001.h"
#include <stdio.h>
#include <string.h>

//COMMUNICATION
#define MAX 80
#define PORT 8080
#define SA struct sockaddr
//CommProtocol
#define HANDSHAKE_ACK  "HANDSHAKE_ACK"

//LCD
#define SELECTED_COLOR 25500
#define MENU_SIZE 3
#define INTERFACES_DIM_MAX 5
#define DATA_BUFFER_DIM 10

/*
 * Values for below macros shall be modified per the access-point's (AP) properties
 * SimpleLink device will connect to following AP when the application is executed
 */
#define SSID_NAME       "SabeFi"       /* Access point name to connect to. */
#define SEC_TYPE        SL_SEC_TYPE_WPA_WPA2     /* Security type of the Access point */
#define PASSKEY         "connettiti1234"   /* Password in case of secure AP */
#define PASSKEY_LEN     pal_Strlen(PASSKEY)      /* Password length in case of secure AP */

#define APPLICATION_VERSION "1.0.0"
///http start
#define SL_STOP_TIMEOUT        0xFF
#define SMALL_BUF           32
#define MAX_SEND_BUF_SIZE   512
#define MAX_SEND_RCV_SIZE   1024



bool isConfigurationMode = false;
//tcp var
int sockfd, connfd, len;
struct sockaddr_in servaddr, cli;
int firstStart;


/*
 * STATIC FUNCTION DEFINITIONS -- Start
 */
static _i32 establishConnectionWithAP();
static _i32 disconnectFromAP();
static _i32 configureSimpleLinkToDefaultState();
static _i32 initializeAppVariables();
static void displayBanner();
static _i32 getHostIP();
static _i32 createConnection();


typedef struct
{
    int currentPos;
    float bufferData[DATA_BUFFER_DIM];
} Data_t;

Data_t tempData;
Data_t luxData;

int ADC14enabled = 0;
int back = 0;
int dataPos = 0;
int pressed = 0;
int currentState;
int selectedElement = 0;
int samplingStop;
int rerender;

/* Graphic library context */
Graphics_Context g_sContext;

/* ADC results buffer */
static uint16_t resultsBuffer[2];

//definig a pointer to void function not receiving parameters as behaviour_t
typedef void (*behaviour_t)();

//defining state_t type which will contain all the characterizing elements of each state the machine can be into.
//this provides a sort of encapsulation for the elements we will work with
typedef struct
{
    // element selection
    int selectedElement;
    int (*selectionFunction)();

    // interfaces handling
    int interfacesDim;
    int selectedInterface;
    void (*interfaces[INTERFACES_DIM_MAX])();

    // behaviour
    behaviour_t behaviours[INTERFACES_DIM_MAX];

} State_t;

State_t states[4];  //the array of states the machine will move into
Graphics_Rectangle menuRectangles[MENU_SIZE];   //array of rectangles that contains a rectangle for each state the machine can fall into.
                                                //these will be displayed into the menu state

int communicationRoutine();

//-------------------------------------MENU STATE----------------------------

void menuRectanglesInit()
{

    int height = 30;
    int space = 10;
    int i = 0;

    int XMIN = 5;
    int XMAX = 128-XMIN;
    int YMIN = 5;

    for(i ; i<MENU_SIZE;i++)
    {
        menuRectangles[i].xMin=XMIN;
        menuRectangles[i].xMax=XMAX;
        menuRectangles[i].yMin=YMIN+i*space+i*height;
        menuRectangles[i].yMax=menuRectangles[i].yMin+height;
    }

//    menuRectangles[0].xMin = 5;
//    menuRectangles[0].xMax = 128 - menuRectangles[0].xMin;
//    menuRectangles[0].yMin = 5;
//    menuRectangles[0].yMax = menuRectangles[0].yMin + height;
//
//    menuRectangles[1].xMin = menuRectangles[0].xMin;
//    menuRectangles[1].xMax = menuRectangles[0].xMax;
//    menuRectangles[1].yMin = menuRectangles[0].yMax + space;
//    menuRectangles[1].yMax = menuRectangles[1].yMin + height;
//
//    menuRectangles[2].xMin = menuRectangles[0].xMin;
//    menuRectangles[2].xMax = menuRectangles[0].xMax;
//    menuRectangles[2].yMin = menuRectangles[1].yMax + space;
//    menuRectangles[2].yMax = menuRectangles[2].yMin + height;

}


//*****************************************************************************
//
// this function takes care of the operation of rendering on the lcd display the menu interface
// it first clears the display then draws the rectangle of each choice
// and finally fills the one the current choice is on
//
//*****************************************************************************
void menuInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    int i = 0;

    for (i; i < MENU_SIZE; i++)
    {
        Graphics_drawRectangle(&g_sContext, &menuRectangles[i]);
    }

    Graphics_fillRectangle(&g_sContext, &menuRectangles[selectedElement]);

    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "PAIRING MODE", 18, 64,
            (menuRectangles[0].yMax + menuRectangles[0].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "NORMAL MODE", 18, 64,
            (menuRectangles[1].yMax + menuRectangles[1].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "COMMUNICATION MODE", 18, 64,
            (menuRectangles[2].yMax + menuRectangles[2].yMin) / 2, OPAQUE_TEXT);

}


//*****************************************************************************
//
// this function contains the behaviour the machine will do in menu state behaviour
// It's currently empty because all the actions in that state is handled
//by menuSelectionFunction
//
//*****************************************************************************
void menuStateBehaviour()
{

    //menuInterfaceRender();

