matteogastaldello/msp432-endpoint/main.c
}

//*****************************************************************************
//
// this function contains the selectionfunction the machine will do in menu state behaviour
// it handles the joystick sampling results and behaves upon them
//
//*****************************************************************************
int menuSelectionFunction()
{

    int intermediateValue;

    if (samplingStop == 0)
    {
        if (resultsBuffer[1] > 16330)    // joystick turned up
        {
            selectedElement--;
            samplingStop = 1;
            rerender = 1;

        }
        else if (resultsBuffer[1] < 50)    // joystick turned down
        {
            selectedElement++;
            samplingStop = 1;
            rerender = 1;

        }

        if (selectedElement < 0)
        {
            selectedElement = MENU_SIZE + selectedElement;
        }

        intermediateValue = selectedElement % MENU_SIZE;
        selectedElement = intermediateValue % MENU_SIZE;

        int i = 0;
        for (i; i < 300250; i++);   // busy wait just to let some time pass before the new sample is taken


        if (!(P4IN & GPIO_PIN1) && pressed == 0)
        {
            pressed = 1;
            rerender = 1;

            int i = 0;
            for (i; i < 300250; i++);   // busy wait just to let some time pass before the new sample is taken

            pressed = 0;


            currentState = selectedElement;
            ADC14enabled = 0;


        }

    }

    samplingStop = 0;

    return 0;
}

//-------------------------------------NORMAL STATE----------------------------



//*****************************************************************************
//
// this function takes care of the operation of rendering on the lcd display the data being sensed by the board
// it first clears the display then draws writes the most recent measured data for each of the involved sensors
//
//*****************************************************************************
void normalModeRender()
{
    Graphics_clearDisplay(&g_sContext);
    //Graphics_drawRectangle(&g_sContext,&menuRectangles[0]);
    /* Display temperature */
    char tempString[30];
    char luxString[30];

    sprintf(tempString, "TEMP: %f", tempData.bufferData[tempData.currentPos]);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) tempString, 11, 55, 40,
    OPAQUE_TEXT);

    sprintf(luxString, "LUX: %f", luxData.bufferData[luxData.currentPos]);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) luxString, 11, 55, 60,
        OPAQUE_TEXT);



}

//*****************************************************************************
//
// this function sets the beahviour for the board in normalMode
// it retrievs a data from each of the active sensors then it stores it in a dedicated buffer
// inside a struct and also changes in a circular way a variable linked to the position
// of the data inside the mentioned buffer
//
//*****************************************************************************
void normalModeBehaviour()
{


    float currentLuxData = OPT3001_getLux();
    luxData.bufferData[luxData.currentPos] = currentLuxData;
    int luxPartialPos = luxData.currentPos +1;
    luxData.currentPos = luxPartialPos % DATA_BUFFER_DIM;

    /* Obtain temperature value from TMP006 */
    float tempIntermediate = TMP006_getTemp();


    tempIntermediate  = tempIntermediate - 32;
    tempData.bufferData[tempData.currentPos] = tempIntermediate * 5/9;

    int tempPartialPos = tempData.currentPos +1;//tempData.currentPos++;
    tempData.currentPos = tempPartialPos % DATA_BUFFER_DIM;


    rerender = 1;

}

//-------------------------------------PAIRING STATE----------------------------


//*****************************************************************************
//
// this function takes care of rendering the interface of pairing state when the
// board is in pairing state. It first clears the display then shows a string
//
//*****************************************************************************
void pairingInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "Pairing", 7, 64, 30,
    OPAQUE_TEXT);
    rerender = 0;
}

//*****************************************************************************
//
// this function takes care of rendering the interface of pairing state when the
// board is in pairing state. It first clears the display then shows a string
//
//*****************************************************************************
void pairedInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "Paired", 7, 64, 30,OPAQUE_TEXT);
    rerender = 0;
}

//*****************************************************************************
//
// this function contains the behaviour the board follows when in pairing state.
//
//
//*****************************************************************************
void pairingBehaviour()
{
    //(*states[currentState].interfaces[states[currentState].selectedInterface])();




    // add pairing code HERE

}

//-------------------------------------COMMUNICATION STATE----------------------------


void communicationInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    char title[20];
    sprintf(title, "%s", "COLLECTED DATA");
    Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 14, 64, 5,OPAQUE_TEXT);



    char dataString[10];
    int i = 0;
    //char space[] = " ";

    for (i; i < DATA_BUFFER_DIM; i++)
    {
//        char currentData[5];
//        itoa(tempData.bufferData[0], currentData);
//        strncat(dataString, currentData, 2);
//        strncat(dataString, space, 1);

        sprintf(dataString,"%f",tempData.bufferData[i]);
        Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString,10, 64, 20+i*10,OPAQUE_TEXT);
    }

    rerender = 0;



