matteogastaldello/msp432-endpoint/main.c
}

//*****************************************************************************
//
// this function shows the latest collected data from the temperature sensor mounted into the board
//
//*****************************************************************************
void tempDataInterface()
{
    Graphics_clearDisplay(&g_sContext);

       char title[20];
       sprintf(title, "%s", "COLLECTED DATA-TEMP");
       Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 19, 64, 5,OPAQUE_TEXT);



       char dataString[10];
       int i = 0;
       //char space[] = " ";

       for (i; i < DATA_BUFFER_DIM; i++)
       {


           sprintf(dataString,"%f",tempData.bufferData[i]);
           Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString,10, 64, 20+i*10,OPAQUE_TEXT);
       }

       rerender = 0;


}

//*****************************************************************************
//
// this function shows the latest collected data from the light sensor mounted into the board
//
//*****************************************************************************
void luxDataInterface()
{
    Graphics_clearDisplay(&g_sContext);

       char title[20];
       sprintf(title, "%s", "COLLECTED DATA-LUX");
       Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 18, 64, 5,OPAQUE_TEXT);



       char dataString[10];
       int i = 0;

       for (i; i < DATA_BUFFER_DIM; i++)
       {


           sprintf(dataString,"%f",luxData.bufferData[i]);
           Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString,10, 64, 20+i*10,OPAQUE_TEXT);
       }

       rerender = 0;


}


//*****************************************************************************
//
// this function shows the latest collected data from the light sensor mounted into the board
//
//*****************************************************************************
void interfacePlaceholder()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "INTERFACE PLACEHOLDER",
                                21, 64, 50, OPAQUE_TEXT);

}

void noBehaviour()
{

    //(*states[currentState].interfaces[states[currentState].selectedInterface])();

}

int noSelectionFunction()
{
    ADC14_disableModule();
    return 0;
}

int backSelectionFunction()
{
    if (!(P4IN & GPIO_PIN1))
    {
        // TEST CHECK
        //Graphics_clearDisplay(&g_sContext);
        //Graphics_drawStringCentered(&g_sContext, (int8_t*) "BACK FUNC", 9, 64,10, OPAQUE_TEXT);

        // CODICE
        rerender = 1;
        currentState = 3;


        //interfacePlaceholder(); //*(states[currentState].interfaces[states[currentState].selectedInterface])();
    }
    return 0;
}


int communicateSelectionFunction()
{
    //char string[30];

       //renderStop = 0;
       int intermediateValue;

       if (samplingStop == 0)
       {
           if (resultsBuffer[0] > 16330)    // joystick turned left
           {
               int intermediateInterface = states[currentState].selectedInterface+1;
               states[currentState].selectedInterface = intermediateInterface % states[currentState].interfacesDim;


               samplingStop = 1;
               rerender = 1;

           }
           else if (resultsBuffer[0] < 50)    // joystick turned right
           {
               int intermediateInterface = states[currentState].selectedInterface+1;
               states[currentState].selectedInterface = intermediateInterface % states[currentState].interfacesDim;

               samplingStop = 1;
               rerender = 1;
               //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,18,64,50,OPAQUE_TEXT);

           }


           //sprintf(string, "SElem : %d",selectedElement);
           //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,30,64,50,OPAQUE_TEXT);

           int i = 0;
           for (i; i < 300250; i++);
           samplingStop = 0;
              // busy wait per scandire il tempo di campionamento

           //Graphics_drawStringCentered(&g_sContext,(int8_t *) itoa(selectedElement,string) ,4,64,50,OPAQUE_TEXT);
   //       if (rerender==1)
   //       {
   //           menuInterfaceRender();
   //           rerender = 0;
   //       }


    if (!(P4IN & GPIO_PIN1))
    {
        // TEST CHECK
        //Graphics_clearDisplay(&g_sContext);
        //Graphics_drawStringCentered(&g_sContext, (int8_t*) "BACK FUNC", 9, 64,10, OPAQUE_TEXT);

        // CODICE
        rerender = 1;
        currentState = 3;


        //interfacePlaceholder(); //*(states[currentState].interfaces[states[currentState].selectedInterface])();
    }
       }
    return 0;
}

void render()
{
    if (rerender == 1)
    {
        (*states[currentState].interfaces[states[currentState].selectedInterface])();
        rerender = 0;
    }

}


void statesInitializer()
{
    // states are sorted thinking about the flow interactions should follow --- pairing, then collecting data, then communication to send it
    // menu is put at the last one and will be avoided scrolling using the joystick

    // states[0] initialization -- pairing state

    states[0].selectedElement = -1;
    states[0].selectionFunction = &backSelectionFunction;
    states[0].interfacesDim = 3; //pairing,paired,error
    states[0].selectedInterface = 0;
    states[0].interfaces[0] = &pairingInterfaceRender;           //ok
    states[0].behaviours[0] = &pairingBehaviour;

    // states[1] initialization -- normal state

    states[1].selectedElement = -1;
    states[1].selectionFunction = &backSelectionFunction;
    states[1].interfacesDim = 1;   // mostra i dati irt
    states[1].selectedInterface = 0;
    states[1].interfaces[0] = &normalModeRender;
    states[1].behaviours[0] = &normalModeBehaviour;

    // states[2] initialization -- communication state

    states[2].selectedElement = -1;
    states[2].selectionFunction = &communicateSelectionFunction;
    states[2].interfacesDim = 2; // sending, ok,error
    states[2].selectedInterface = 0;
    states[2].interfaces[0] = &tempDataInterface;//communicationInterfaceRender;            //ok
    states[2].interfaces[1] = &luxDataInterface;
    states[2].behaviours[0] = &noBehaviour;

