matteogastaldello/msp432-endpoint/main.c
    /* Wait */
    while ((!IS_CONNECTED(g_Status)) || (!IS_IP_ACQUIRED(g_Status)))
    {
        _SlNonOsMainLoopTask();
    }

    return SUCCESS;
}

/*!
 \brief Disconnecting from a WLAN Access point

 This function disconnects from the connected AP

 \param[in]      None

 \return         none

 \note

 \warning        If the WLAN disconnection fails, we will be stuck in this function forever.
 */
static _i32 disconnectFromAP()
{
    _i32 retVal = -1;

    /*
     * The function returns 0 if 'Disconnected done', negative number if already disconnected
     * Wait for 'disconnection' event if 0 is returned, Ignore other return-codes
     */
    retVal = sl_WlanDisconnect();
    if (0 == retVal)
    {
        /* Wait */
        while (IS_CONNECTED(g_Status))
        {
            _SlNonOsMainLoopTask();
        }
    }

    return SUCCESS;
}

/*!
 \brief This function initializes the application variables

 \param[in]  None

 \return     0 on success, negative error-code on error
 */
static _i32 initializeAppVariables()
{
    g_Status = 0;
    pal_Memset(&g_AppData, 0, sizeof(g_AppData));

    return SUCCESS;
}

/*!
 \brief This function displays the application's banner

 \param      None

 \return     None
 */
static void displayBanner()
{
    CLI_Write("\n\r\n\r");
    CLI_Write(" TCP TEST ");
    CLI_Write(APPLICATION_VERSION);
    CLI_Write(
            "\n\r*******************************************************************************\n\r");
}
